TabbycatPie/CustomKeyboard/CH551CustomKeyboard/usar/main.c
//Abandoned
void HIDValueHandle(UINT8 i)
{
	switch(i)
	{
		//键盘数据上传示例
		case 1:
			FLAG = 0;
//			HIDKey[0] = 0x3D;   //F4
//			HIDKey[3] = 0;
//			Enp1IntIn();
			HIDMouse[0] = 0x01;
			HIDMouse[1] = 0x0;
			HIDMouse[2] = 0x0;
			HIDMouse[3] = 0x0;
			Enp2IntIn();
			while(FLAG == 0)
			{
				;    /*等待上一包传输完成*/
			}
			break;
		case 2:
			FLAG = 0;
			//HIDKey[0] = 0x3D;   //F4
			//HIDKey[3] = 0;
			//Enp1IntIn();
			HIDMouse[0] = 0x02;
			HIDMouse[1] = 0x0;
			HIDMouse[2] = 0x0;
			HIDMouse[3] = 0x0;
			Enp2IntIn();
			while(FLAG == 0)
			{
				;    /*等待上一包传输完成*/
			}
			break;
		case 0:
			FLAG = 0;
			//HIDKey[0] = 0;      //按键结束
			//HIDKey[3] = 0;
			//Enp1IntIn();
			HIDMouse[0] = 0x0;
			HIDMouse[1] = 0x0;
			HIDMouse[2] = 0x0;
			HIDMouse[3] = 0x0;
			Enp2IntIn();
			while(FLAG == 0)
			{
				;    /*等待上一包传输完成*/
			}
			break;
		default:                                                          //其他
			UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;     //默认应答NAK
			UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;     //默认应答NAK
			break;
	}
}



UINT8 MOUSE_CODE [10] = {0x01,0x02,0x04,0x03,0x05,0x06,0x07,0x01,0x03,0x04};  //temporily used for mouse 
UINT8 KEY_CODE   [10] = {0x1E,0x1F,0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27};  //temporily used for key 
//UINT8 KEY_CODE_1 [10] = {0x1E,0x10,0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27};  //temporily used for key 1
//UINT8 KEY_CODE_2 [10] = {0x1E,0x10,0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27};  //temporily used for key 2
UINT8 SP_KEY_CODE[10] = {0x01,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};  //temporily used for sepcial key
UINT8 KEY_PRESS  [10] = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};  //if key(n) pressed, key_press[n] == 0xff


//sbit Key1 = P3^3;
sbit Key1  = P3^2;
sbit Key2  = P1^4;
sbit Key3  = P1^5;
sbit Key4  = P1^6;
sbit Key5  = P1^7;
sbit Key6  = P3^1;
sbit Key7  = P3^0;
sbit Key8  = P1^1;
sbit Key9  = P3^3;
sbit Key10 = P3^4;

void scanKey(){
	UINT8 i = 0;
	UINT8 mouse_code = 0x00;
	UINT8 sp_key_code = 0x00;
	UINT8 key_count = 0;
	if(!Key1){
		KEY_PRESS[0]=0xff;
	}
	else{
		KEY_PRESS[0]=0x00;
	}
	if(!Key2){
		KEY_PRESS[1]=0xff;
	}
	else{
		KEY_PRESS[1]=0x00;
	}
	if(!Key3){
		KEY_PRESS[2]=0xff;
	}
	else{
		KEY_PRESS[2]=0x00;
	}
	if(!Key4){
		KEY_PRESS[3]=0xff;
	}
	else{
		KEY_PRESS[3]=0x00;
	}
	if(!Key5){
		KEY_PRESS[4]=0xff;
	}
	else{
		KEY_PRESS[4]=0x00;
	}
	if(!Key6){
		KEY_PRESS[5]=0xff;
	}
	else{
		KEY_PRESS[5]=0x00;
	}
	if(!Key7){
		KEY_PRESS[6]=0xff;
	}
	else{
		KEY_PRESS[6]=0x00;
	}
	if(!Key8){
		KEY_PRESS[7]=0xff;
	}
	else{
		KEY_PRESS[7]=0x00;
	}
	if(!Key9){
		KEY_PRESS[8]=0xff;
	}
	else{
		KEY_PRESS[8]=0x00;
	}
	if(!Key10){
		KEY_PRESS[9]=0xff;
	}
	else{
		KEY_PRESS[9]=0x00;
	}
	mDelaymS(6); //avoid jitter
	if(!Key1){
		if(KEY_PRESS[0]!=0xff){
			KEY_PRESS[0] =0x00;
		}
	}
	if(!Key2){
		if(KEY_PRESS[1]!=0xff){
			KEY_PRESS[1] =0x00;
		}
	}
	if(!Key3){
		if(KEY_PRESS[2]!=0xff){
			KEY_PRESS[2] =0x00;
		}
	}
	if(!Key4){
		if(KEY_PRESS[3]!=0xff){
			KEY_PRESS[3] =0x00;
		}
	}
	if(!Key5){
		if(KEY_PRESS[4]!=0xff){
			KEY_PRESS[4] =0x00;
		}
	}
	if(!Key6){
		if(KEY_PRESS[5]!=0xff){
			KEY_PRESS[5] =0x00;
		}
	}
	if(!Key7){
		if(KEY_PRESS[6]!=0xff){
			KEY_PRESS[6] =0x00;
		}
	}
	if(!Key8){
		if(KEY_PRESS[7]!=0xff){
			KEY_PRESS[7] =0x00;
		}
	}
	if(!Key9){
		if(KEY_PRESS[8]!=0xff){
			KEY_PRESS[8] =0x00;
		}
	}
	if(!Key10){
		if(KEY_PRESS[9]!=0xff){
			KEY_PRESS[9] =0x00;
		}
	}
	
	
	//get final result
	for(;i<10;i++){
		mouse_code  |= MOUSE_CODE[i] &KEY_PRESS[i];
		sp_key_code |= SP_KEY_CODE[i]&KEY_PRESS[i];
		if(key_count<6 && (KEY_PRESS[i]==0xff)){
			HIDKey[2+key_count]=KEY_CODE[i];
			key_count ++;
		}
	}
	
	//FINAL ASSIGNING
	//mouse codes
	HIDMouse[0] = mouse_code;
	//key codes
	HIDKey  [0] = sp_key_code; //special key Byte
	HIDKey  [1] = 0x00;        //reserved
	if(key_count<6){					 //fill blank
		for(i=7;i>=key_count+2;i--){
			HIDKey[i]=0x00;
		}
	}
	
}



void main()
{
    CfgFsys( );                    //CH552时钟选择配置
    mDelaymS(50);                 //修改主频等待内部晶振稳定,必加

	/* 设置P1口为准双向IO口 */
	P1_MOD_OC = 0xff;
	P1_DIR_PU = 0xff;
	//set P3 dual-dir IO port
	P3_MOD_OC = 0xFF;
	P3_DIR_PU = 0xFF;

	USBDeviceInit();              //USB设备模式初始化
    EA = 1;                     //允许单片机中断
    
	UEP1_T_LEN = 0;               //预使用发送长度一定要清空
    FLAG = 0;
    Ready = 0;
	
	//等待USB枚举成功
	while(Ready == 0);
	while(1)
	{
		if(Ready)   //waiting for usb enum finish
		{
			scanKey();
			HIDsend();
			FLAG = 0;
		}
	}
}

